* creating Dummy dataset
* pyspark to pandas
* Show()
* Row
* PySpark Column Class----> 
* alias() for creating alias
* expr for combining columns
* asc() and dsc()
* cast and astype
* between()
* Contains
* endswith() startswith()
* Substr()
* When()
* f.length
* Select()
* Collect()
* withcolum
* withcolumnrenamed
* Distinct()
* dropduplicates()
* orderby() sort()

In [1]:
import findspark
findspark.init()
import pandas as pd
import pyspark
from pyspark.sql import SparkSession

import pyspark.sql.functions as f

from pyspark.sql.functions import col,lit,udf,expr,when
spark=SparkSession.builder.appName("Training").getOrCreate()

### Creating dataframe

* frst meathod

In [3]:
columns = ["language","users_count"]
data = [("Java", "20000"), ("Python", "100000"), ("Scala", "3000")]
df=spark.createDataFrame(data,columns)
df.show()

+--------+-----------+
|language|users_count|
+--------+-----------+
|    Java|      20000|
|  Python|     100000|
|   Scala|       3000|
+--------+-----------+

* Second Meathod

In [4]:
df=spark.createDataFrame(data).toDF(*columns)
df.show()

+--------+-----------+
|language|users_count|
+--------+-----------+
|    Java|      20000|
|  Python|     100000|
|   Scala|       3000|
+--------+-----------+

### reading the csv file

In [6]:
df=spark.read.csv("test1.csv",header=True)
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [12]:
df=spark.read.text("tst.txt")
vl=df.collect()
for i in vl:
    print(i[0])

Name Age city
Nitish 32 delhi
rakesh 33 goa
king 35 agra

## Convert pyspark to pandas

In [15]:
data = [("James","","Smith","36636","M",60000),
        ("Michael","Rose","","40288","M",70000),
        ("Robert","","Williams","42114","",400000),
        ("Maria","Anne","Jones","39192","F",500000),
        ("Jen","Mary","Brown","","F",0)]

columns = ["first_name","middle_name","last_name","dob","gender","salary"]
pysparkDF = spark.createDataFrame(data = data, schema = columns)
pysparkDF.printSchema()
pysparkDF.show(truncate=False)

root
 |-- first_name: string (nullable = true)
 |-- middle_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+----------+-----------+---------+-----+------+------+
|first_name|middle_name|last_name|dob  |gender|salary|
+----------+-----------+---------+-----+------+------+
|James     |           |Smith    |36636|M     |60000 |
|Michael   |Rose       |         |40288|M     |70000 |
|Robert    |           |Williams |42114|      |400000|
|Maria     |Anne       |Jones    |39192|F     |500000|
|Jen       |Mary       |Brown    |     |F     |0     |
+----------+-----------+---------+-----+------+------+

In [16]:
pn=pysparkDF.toPandas()
type(pn)

pandas.core.frame.DataFrame

## Show
* PySpark show() – Display DataFrame Contents in Table

In [19]:
pysparkDF.show(3)

+----------+-----------+---------+-----+------+------+
|first_name|middle_name|last_name|  dob|gender|salary|
+----------+-----------+---------+-----+------+------+
|     James|           |    Smith|36636|     M| 60000|
|   Michael|       Rose|         |40288|     M| 70000|
|    Robert|           | Williams|42114|      |400000|
+----------+-----------+---------+-----+------+------+
only showing top 3 rows

#### truncate
* it truncate the fileds even the numric one

In [24]:
pysparkDF.show(2,truncate=3)

+----------+-----------+---------+---+------+------+
|first_name|middle_name|last_name|dob|gender|salary|
+----------+-----------+---------+---+------+------+
|       Jam|           |      Smi|366|     M|   600|
|       Mic|        Ros|         |402|     M|   700|
+----------+-----------+---------+---+------+------+
only showing top 2 rows

### Display Contents Vertically

In [26]:
pysparkDF.show(2,truncate=3,vertical=True)

-RECORD 0----------
 first_name  | Jam
 middle_name |
 last_name   | Smi
 dob         | 366
 gender      | M
 salary      | 600
-RECORD 1----------
 first_name  | Mic
 middle_name | Ros
 last_name   |
 dob         | 402
 gender      | M
 salary      | 700
only showing top 2 rows

# Row

In [29]:
from pyspark.sql import Row
s=Row("Nitish","Bhardwaj")
print(s[0]+" "+s[1])

Nitish Bhardwaj

In [30]:
s=Row(name="Alice", age=11)
print(s["name"])

Alice

### Using Row class on PySpark RDD

In [32]:
data = [Row(name="James,,Smith",lang=["Java","Scala","C++"],state="CA"), 
    Row(name="Michael,Rose,",lang=["Spark","Java","C++"],state="NJ"),
    Row(name="Robert,,Williams",lang=["CSharp","VB"],state="NV")]
rdd=spark.sparkContext.parallelize(data)
print(rdd.collect())

[Row(name='James,,Smith', lang=['Java', 'Scala', 'C++'], state='CA'), Row(name='Michael,Rose,', lang=['Spark', 'Java', 'C++'], state='NJ'), Row(name='Robert,,Williams', lang=['CSharp', 'VB'], state='NV')]

In [34]:
colData=rdd.collect()
for i in colData:
    print(i.name+" "+str(i.lang))

James,,Smith ['Java', 'Scala', 'C++']
Michael,Rose, ['Spark', 'Java', 'C++']
Robert,,Williams ['CSharp', 'VB']

### Using Dataframe

In [35]:
df=spark.createDataFrame(data)
df.show()

+----------------+------------------+-----+
|            name|              lang|state|
+----------------+------------------+-----+
|    James,,Smith|[Java, Scala, C++]|   CA|
|   Michael,Rose,|[Spark, Java, C++]|   NJ|
|Robert,,Williams|      [CSharp, VB]|   NV|
+----------------+------------------+-----+

#### we can also change the columns name

In [36]:
columns = ["name","languagesAtSchool","currentState"]
df=spark.createDataFrame(data).toDF(*columns)
df.show()

+----------------+------------------+------------+
|            name| languagesAtSchool|currentState|
+----------------+------------------+------------+
|    James,,Smith|[Java, Scala, C++]|          CA|
|   Michael,Rose,|[Spark, Java, C++]|          NJ|
|Robert,,Williams|      [CSharp, VB]|          NV|
+----------------+------------------+------------+

## PySpark Column Class | Operators & Functions

In [37]:

data=[("James","Bond","100",None),
      ("Ann","Varsa","200",'F'),
      ("Tom Cruise","XXX","400",''),
      ("Tom Brand",None,"400",'M')] 
columns=["fname","lname","id","gender"]
df=spark.createDataFrame(data,columns)
df.show()

+----------+-----+---+------+
|     fname|lname| id|gender|
+----------+-----+---+------+
|     James| Bond|100|  null|
|       Ann|Varsa|200|     F|
|Tom Cruise|  XXX|400|      |
| Tom Brand| null|400|     M|
+----------+-----+---+------+

### 1 alias() – Set’s name to Column

* Combining fname and lname into name using expr and alias

In [38]:
df.select(col("*"),expr("fname || '_'|| lname").alias("Name")).show()

+----------+-----+---+------+--------------+
|     fname|lname| id|gender|          Name|
+----------+-----+---+------+--------------+
|     James| Bond|100|  null|    James_Bond|
|       Ann|Varsa|200|     F|     Ann_Varsa|
|Tom Cruise|  XXX|400|      |Tom Cruise_XXX|
| Tom Brand| null|400|     M|          null|
+----------+-----+---+------+--------------+

In [71]:
## chnage gender to Sex
df.select(df.gender.alias("Sex")).show()

+----+
| Sex|
+----+
|null|
|   F|
|    |
|   M|
+----+

## 2- asc() & desc()

In [73]:
df.sort(col("id").desc()).show()

+----------+-----+---+------+
|     fname|lname| id|gender|
+----------+-----+---+------+
|Tom Cruise|  XXX|400|      |
| Tom Brand| null|400|     M|
|       Ann|Varsa|200|     F|
|     James| Bond|100|  null|
+----------+-----+---+------+

In [77]:
df.sort(col("fname").asc()).show()

+----------+-----+---+------+
|     fname|lname| id|gender|
+----------+-----+---+------+
|       Ann|Varsa|200|     F|
|     James| Bond|100|  null|
| Tom Brand| null|400|     M|
|Tom Cruise|  XXX|400|      |
+----------+-----+---+------+

## Cast and astype

In [22]:
df=spark.read.csv("test1.csv",header=True)
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: string (nullable = true)

In [81]:
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [80]:
df.withColumn("age",col("age").cast("int"))\
  .withColumn("Salary",col("Salary").astype("int")).printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: integer (nullable = true)

## Between
* between() – Returns a Boolean expression when a column values in between lower and upper bound.

In [83]:
df.filter(df.age.between(21,30)).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [84]:
df.where(df["age"].between(21,30)).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

# contains
* contains() – Checks if a DataFrame column value contains a a value specified in this function.

In [86]:
df.where(df.Name.contains("S")).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

## startswith() & endswith() – 
* Checks if the value of the DataFrame Column starts and ends with a String respectively.

In [87]:
df.filter(df.Name.startswith("Su")).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
+---------+---+----------+------+

In [88]:
df.filter(df.Name.endswith("am")).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [89]:
df.filter((df.Name.startswith("Su")) & (df.Name.endswith("u"))).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|Sudhanshu| 30|         8| 25000|
+---------+---+----------+------+

## isNull & isNotNull() – 
* Checks if the DataFrame column has NULL or non NULL values.

In [105]:
df=spark.read.csv("test1.csv",header=True)
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [94]:
df.filter(df.age.isNull()).show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
|Mahesh|null|      null| 40000|
+------+----+----------+------+

In [97]:
df.filter(df.Name.isNotNull()).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
+---------+----+----------+------+

### like() & rlike()

In [100]:
df.where(df.Name.like("%au%")).show()

+----+---+----------+------+
|Name|age|Experience|Salary|
+----+---+----------+------+
|Paul| 24|         3| 20000|
+----+---+----------+------+

In [103]:
df.where(df.Name.like("_a__")).show()

+----+---+----------+------+
|Name|age|Experience|Salary|
+----+---+----------+------+
|Paul| 24|         3| 20000|
+----+---+----------+------+

## Substr() – 
* Returns a Column after getting sub string from the Column

In [113]:
df.select(df.Name.substr(1,3).alias("Substr_name")).show()

+-----------+
|Substr_name|
+-----------+
|        Kri|
|        Sud|
|        Sun|
|        Pau|
|        Har|
|        Shu|
|        Mah|
|       null|
|       null|
+-----------+

In [114]:
df.filter(df.Name.substr(1,3)=="Sun").show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|Sunny| 29|         4| 20000|
+-----+---+----------+------+

## length finding of a column

In [117]:
import pyspark.sql.functions as f
df.withColumn("new_lth",f.length(col("Name").alias("Name_lth"))).show()

+---------+----+----------+------+-------+
|     Name| age|Experience|Salary|new_lth|
+---------+----+----------+------+-------+
|    Krish|  31|        10| 30000|      5|
|Sudhanshu|  30|         8| 25000|      9|
|    Sunny|  29|         4| 20000|      5|
|     Paul|  24|         3| 20000|      4|
|   Harsha|  21|         1| 15000|      6|
|  Shubham|  23|         2| 18000|      7|
|   Mahesh|null|      null| 40000|      6|
|     null|  34|        10| 38000|   null|
|     null|  36|      null|  null|   null|
+---------+----+----------+------+-------+

## when() & otherwise() –
* It is similar to SQL Case When, executes sequence of expressions until it matches the condition and returns a value when match.

In [124]:
df.select(col("*"),when(col("Experience").between(1,3),"Fresher")\
         .when(col("Experience").between(4,8),"Intermediate")\
         .otherwise("Expert").alias("Level")).show()

+---------+----+----------+------+------------+
|     Name| age|Experience|Salary|       Level|
+---------+----+----------+------+------------+
|    Krish|  31|        10| 30000|      Expert|
|Sudhanshu|  30|         8| 25000|Intermediate|
|    Sunny|  29|         4| 20000|Intermediate|
|     Paul|  24|         3| 20000|     Fresher|
|   Harsha|  21|         1| 15000|     Fresher|
|  Shubham|  23|         2| 18000|     Fresher|
|   Mahesh|null|      null| 40000|      Expert|
|     null|  34|        10| 38000|      Expert|
|     null|  36|      null|  null|      Expert|
+---------+----+----------+------+------------+

## Isin()

In [125]:
l=[3,4,8]
df.filter(col("Experience").isin(l)).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
+---------+---+----------+------+

## Select()

In [14]:
df.select(["firstname","lastname"]).show()

+---------+--------+
|firstname|lastname|
+---------+--------+
|    James|   Smith|
|  Michael|        |
|   Robert|Williams|
|    Maria|   Jones|
|      Jen|   Brown|
+---------+--------+

### Fteching all columns

In [23]:
df.select(col("*")).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

#### fetching selected columns

In [25]:
cols=[i for i in df.columns if i not in ["age","Salary"]]
df2=df.select(cols)
df2.show()

+---------+----------+
|     Name|Experience|
+---------+----------+
|    Krish|        10|
|Sudhanshu|         8|
|    Sunny|         4|
|     Paul|         3|
|   Harsha|         1|
|  Shubham|         2|
|   Mahesh|      null|
|     null|        10|
|     null|      null|
+---------+----------+

### Select Columns by Index

* fetching selected columns

In [27]:
df.select(df.columns[:2]).show()

+---------+----+
|     Name| age|
+---------+----+
|    Krish|  31|
|Sudhanshu|  30|
|    Sunny|  29|
|     Paul|  24|
|   Harsha|  21|
|  Shubham|  23|
|   Mahesh|null|
|     null|  34|
|     null|  36|
+---------+----+

In [32]:
## fetching age and Experience column
df.select(df.columns[1:3]).show(3)

+---+----------+
|age|Experience|
+---+----------+
| 31|        10|
| 30|         8|
| 29|         4|
+---+----------+
only showing top 3 rows

##  collect() 
* it is an action operation that is used to retrieve all the elements of the dataset (from all nodes) to the driver node. We should use the collect() on smaller dataset usually after filter(), group() e

In [34]:
clct=df.collect()
dt=clct
dt

[Row(Name='Krish', age='31', Experience='10', Salary='30000'),
 Row(Name='Sudhanshu', age='30', Experience='8', Salary='25000'),
 Row(Name='Sunny', age='29', Experience='4', Salary='20000'),
 Row(Name='Paul', age='24', Experience='3', Salary='20000'),
 Row(Name='Harsha', age='21', Experience='1', Salary='15000'),
 Row(Name='Shubham', age='23', Experience='2', Salary='18000'),
 Row(Name='Mahesh', age=None, Experience=None, Salary='40000'),
 Row(Name=None, age='34', Experience='10', Salary='38000'),
 Row(Name=None, age='36', Experience=None, Salary=None)]

In [36]:
for i in dt:
    print(i.Name)

Krish
Sudhanshu
Sunny
Paul
Harsha
Shubham
Mahesh
None
None

In [38]:
dt[0:3]

[Row(Name='Krish', age='31', Experience='10', Salary='30000'),
 Row(Name='Sudhanshu', age='30', Experience='8', Salary='25000'),
 Row(Name='Sunny', age='29', Experience='4', Salary='20000')]

In [42]:
dt[0][0]

'Krish'

## withcolumns()
* PySpark withColumn() is a transformation function of DataFrame which is used to change the value, convert the datatype of an existing column, create a new column, and many more

In [43]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: string (nullable = true)

### Change DataType using PySpark withColumn()

In [45]:
df.withColumn("age",col("age").cast("int")) \
  .withColumn("Salary",col("Salary").astype("int")).printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: integer (nullable = true)

#### Update The Value of an Existing Column

In [46]:
df.withColumn("age",col("age")+10).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|41.0|        10| 30000|
|Sudhanshu|40.0|         8| 25000|
|    Sunny|39.0|         4| 20000|
|     Paul|34.0|         3| 20000|
|   Harsha|31.0|         1| 15000|
|  Shubham|33.0|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|44.0|        10| 38000|
|     null|46.0|      null|  null|
+---------+----+----------+------+

### creating new column

* lit() used to create static value in a column

In [50]:
df.withColumn("Bonus",(col("Salary")*10)/100) \
  .withColumn("City",lit("Muzaffarnagar")).show()

+---------+----+----------+------+------+-------------+
|     Name| age|Experience|Salary| Bonus|         City|
+---------+----+----------+------+------+-------------+
|    Krish|  31|        10| 30000|3000.0|Muzaffarnagar|
|Sudhanshu|  30|         8| 25000|2500.0|Muzaffarnagar|
|    Sunny|  29|         4| 20000|2000.0|Muzaffarnagar|
|     Paul|  24|         3| 20000|2000.0|Muzaffarnagar|
|   Harsha|  21|         1| 15000|1500.0|Muzaffarnagar|
|  Shubham|  23|         2| 18000|1800.0|Muzaffarnagar|
|   Mahesh|null|      null| 40000|4000.0|Muzaffarnagar|
|     null|  34|        10| 38000|3800.0|Muzaffarnagar|
|     null|  36|      null|  null|  null|Muzaffarnagar|
+---------+----+----------+------+------+-------------+

## Rename Column Name

In [51]:
df.withColumnRenamed("age","Umar").show()

+---------+----+----------+------+
|     Name|Umar|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

### on multiple column

In [52]:
df.withColumnRenamed("age","Umar") \
  .withColumnRenamed("Name","Naam").show()

+---------+----+----------+------+
|     Naam|Umar|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

### PySpark Distinct to Drop Duplicate Rows

In [53]:
# Prepare Data
data = [("James", "Sales", 3000), \
    ("Michael", "Sales", 4600), \
    ("Robert", "Sales", 4100), \
    ("Maria", "Finance", 3000), \
    ("James", "Sales", 3000), \
    ("Scott", "Finance", 3300), \
    ("Jen", "Finance", 3900), \
    ("Jeff", "Marketing", 3000), \
    ("Kumar", "Marketing", 2000), \
    ("Saif", "Sales", 4100) \
  ]

# Create DataFrame
columns= ["employee_name", "department", "salary"]
df = spark.createDataFrame(data = data, schema = columns)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- salary: long (nullable = true)

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|James        |Sales     |3000  |
|Michael      |Sales     |4600  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|James        |Sales     |3000  |
|Scott        |Finance   |3300  |
|Jen          |Finance   |3900  |
|Jeff         |Marketing |3000  |
|Kumar        |Marketing |2000  |
|Saif         |Sales     |4100  |
+-------------+----------+------+

## Distinct

In [54]:
df.select(col("*")).distinct().show()

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|      Michael|     Sales|  4600|
|        James|     Sales|  3000|
|       Robert|     Sales|  4100|
|        Maria|   Finance|  3000|
|        Scott|   Finance|  3300|
|          Jen|   Finance|  3900|
|        Kumar| Marketing|  2000|
|         Jeff| Marketing|  3000|
|         Saif|     Sales|  4100|
+-------------+----------+------+

In [55]:
df.select(col("employee_name")).distinct().show()

+-------------+
|employee_name|
+-------------+
|        James|
|      Michael|
|        Maria|
|       Robert|
|        Scott|
|          Jen|
|        Kumar|
|         Saif|
|         Jeff|
+-------------+

In [58]:
df.select(col("department")).distinct().count()

3

### Drop Duplicates

In [59]:
df.dropDuplicates().show()

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|      Michael|     Sales|  4600|
|        James|     Sales|  3000|
|       Robert|     Sales|  4100|
|        Maria|   Finance|  3000|
|        Scott|   Finance|  3300|
|          Jen|   Finance|  3900|
|        Kumar| Marketing|  2000|
|         Jeff| Marketing|  3000|
|         Saif|     Sales|  4100|
+-------------+----------+------+

### dropping duplicates from multiple columns

In [61]:
df.dropDuplicates(["employee_name","department"]).show()

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|      Michael|     Sales|  4600|
|        James|     Sales|  3000|
|        Maria|   Finance|  3000|
|       Robert|     Sales|  4100|
|        Scott|   Finance|  3300|
|          Jen|   Finance|  3900|
|         Jeff| Marketing|  3000|
|         Saif|     Sales|  4100|
|        Kumar| Marketing|  2000|
+-------------+----------+------+

In [62]:
print("distinct value of employee_name,department : "+str(df.dropDuplicates(["employee_name","department"]).count()))

distinct value of employee_name,department : 9

### orderby()    sort()

In [63]:

simpleData = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000), \
    ("Raman","Finance","CA",99000,40,24000), \
    ("Scott","Finance","NY",83000,36,19000), \
    ("Jen","Finance","NY",79000,53,15000), \
    ("Jeff","Marketing","CA",80000,25,18000), \
    ("Kumar","Marketing","NY",91000,50,21000) \
  ]
columns= ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

In [64]:
df.sort("age").show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        Maria|   Finance|   CA| 90000| 24|23000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        James|     Sales|   NY| 90000| 34|10000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|      Michael|     Sales|   NY| 86000| 56|20000|
+-------------+----------+-----+------+---+-----+

* sorting by mulptiple column

In [66]:
df.sort(["employee_name","age"]).show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Scott|   Finance|   NY| 83000| 36|19000|
+-------------+----------+-----+------+---+-----+

### Sortuing one column ascending and other descending

In [67]:
df.sort(col("department").asc(),col("age").desc()).show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|          Jen|   Finance|   NY| 79000| 53|15000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        James|     Sales|   NY| 90000| 34|10000|
|       Robert|     Sales|   CA| 81000| 30|23000|
+-------------+----------+-----+------+---+-----+